{"avis":["Nous sommes incapables de charger Disqus. Si vous êtes un modérateur, veuillez s'il vous plaît consulter notre guide de résolution des problèmes.","Favoriting means this is a discussion worth sharing. It gets shared to your followers' Disqus feeds, and gives the creator kudos!","Please access our Politique de confidentialité to learn what personal data Disqus collects and your choices about how it is used.  All users of our service are also subject to our Conditions d'utilisation.","Problème de connexion Facebook et meta j ai du mal de publier tes publications importantes\nPour mon télétravail.\nJ espère que vous allez réparer je compte sur vous","Beaucoup d'erreur pour mettre un commentaire sur une publication en ce moment","Bonsoir, je suis une joueuse de Demon Slayer et j'interviens pour mes amis qui connectent leur perso depuis facebook. Depuis le 09/11, ils n'y arrivent plus. il semble que leur UID ait changé. Donc à la connexion, ils arrivent sur la page de création d'un personnage et non plus sur leur compte. Est ce que quelqu'un sait comment faire pour les aider ? D'avance merci","TOUJOURS AUSSI CRIMINELS !!! ALORS ON CENSURE TOUT CE QUI TOUCHE AU COVID ???","Depuis hier matin je n'arrive a rien sur Facebook sa devient insupportable déjà que les publications récentes on n'arrive plus à les voir comme avant du coup la on revoit les mêmes choses toutes la journée ne voit pas les publications de mes amis à cause des pages que j'aime ou de je ne sais quoi enfin sa donne de moins en moins envie d'y aller","Impossible d'ouvrir les Documents dans Fichiers dans un groupe Facebook, depuis un ordinateur, mais possible depuis un smartphone. Facebook a supprimé l'onglet Documents dans les groupes et depuis ce matin, impossible d'ouvrir ceux archivés sur un ordinateur.","Attention hausse de compte pyraté ! Ne cliqué sur aucun lien que vous envoie vos amis, collègues ou autres sauf si il vous confirme que c'est lui !!!!","ça va durer encore longtemps??? mes \"guides\" sont toujours vides ou incomplets. est-ce que quelqu'un se trouve dans le même cas ou suis-je seule au monde?","Toujours planté FB, je n'arrive toujours pas à avoir accès à mes guides. Ont-ils disparus ???"]}