{"avis":["Ajouter France 24 à votre écran d'accueil","© 2021 Copyright France 24 - Tous droits réservés. France 24 n'est pas responsable des contenus provenant de sites Internet externes. Fréquentation certifiée par l'ACPM/OJD.","Publié le : 04/10/2021 - 20:06\nModifié le : 04/10/2021 - 20:07","Facebook, son application de partage de photos Instagram et ses applications de messagerie WhatsApp et Messenger ont été touchés, lundi, par une panne d'envergure en raison de \"changements de configuration\" dans les serveurs. Ils sont revenus à la normale dans la nuit.","Facebook, Instagram, WhatsApp et Messenger, les deux réseaux sociaux et les deux messageries du géant californien, ont subi une panne massive, lundi 4 octobre, affectant potentiellement plusieurs milliards d'utilisateurs dans le monde, alors que le groupe traverse l'une de ses pires crises de relations publiques.","Ils ont été rétablis progressivement, dans la nuit de lundi à mardi, ont constaté des journalistes de l’AFP et de nombreux utilisateurs, après près de sept heures de panne.","Sur le site Downdetector, qui suit les pannes des services numériques et qui a identifié celle du géant des réseaux sociaux comme \"la plus importante qu’il ait jamais observée\", les signalements d’incidents étaient largement en baisse vers minuit.","Facebook a indiqué, dans un communiqué, que la panne majeure de ses réseaux et messageries avait été causée par un \"changement de configuration défectueux'\" de ses serveurs.","Chute du cours de Facebook à Wall Street","\"Ce site est inaccessible\", \"Impossible de trouver l'adresse du serveur\", indiquait le site de Facebook à de nombreux utilisateurs lundi vers 16 h GMT (18 h à Paris). La panne semblait durer depuis environ une heure.","\"Nous sommes au courant que certaines personnes ont du mal à accéder à nos applications et produits. Nous travaillons à un retour à la normale le plus rapidement possible et nous présentons nos excuses pour ce désagrément\", a tweeté Andy Stone, un porte-parole de Facebook.","We’re aware that some people are having trouble accessing our apps and products. We’re working to get things back to normal as quickly as possible, and we apologize for any inconvenience.","\"Nous présentons nos excuses à ceux qui ont été affectés\", a ajouté Facebook.","Les pertes de revenus publicitaires sont estimées à 470 000 euros par heure. ","\"Donner la priorité à la croissance plutôt qu'à la sûreté\"","Cette panne est survenue au lendemain de la prise de parole sur CBS d’une lanceuse d’alerte. Ancienne ingénieure cheffe de produit chez Facebook, Frances Haugen a fait fuiter de nombreux documents internes et a accusé le groupe de \"(choisir) le profit plutôt que la sûreté\" de ses utilisateurs.","Avant son départ de l'entreprise, en mai, Frances Haugen avait emporté avec elle de nombreux documents issus de recherches internes à l'entreprise, qu'elle a confiés notamment au Wall Street Journal.","Dans un article publié mi-septembre, le quotidien a révélé, sur la base de ces informations, que l'entreprise effectuait des recherches sur son réseau social Instagram depuis trois ans pour en déterminer les effets sur les adolescents.","Facebook whistleblower Frances Haugen says political parties have been quoted in Facebook’s own research saying they know Facebook changed its algorithm and “now if [they] don't publish angry, hateful, polarizing… content,” there’s less engagement. https://t.co/XKKBhxZZ36 pic.twitter.com/tvSmVIJfWT","Le résumé de la semaine\nFrance 24 vous propose de revenir sur les actualités qui ont marqué la semaine","Les études évoquent notamment les liens entre le mythe du corps féminin idéal véhiculé par de nombreux contenus sur les réseaux et les risques pour la santé mentale des adolescentes complexées.","La lanceuse d'alerte est aussi revenue sur le scrutin présidentiel américain de novembre 2020, quand Facebook avait modifié ses algorithmes pour réduire la diffusion de fausses informations.","Mais selon Frances Haugen, \"dès que l'élection a été terminée\", le groupe les a reconfigurés comme avant, \"pour donner la priorité à la croissance plutôt qu'à la sûreté\", a-t-elle soutenu dans son entretien à l'émission \"60 Minutes\", sur CBS.","Elle doit être interrogée mardi par les élus américains lors d'une audition consacrée à l'impact de Facebook et Instagram sur les jeunes utilisateurs, une semaine après une longue séance de questions des sénateurs adressées à Antigone Davis, responsable de la sécurité et de l'enfance au sein de la firme.","Emportez l'actualité internationale partout avec vous ! Téléchargez l'application France 24","Facebook démantèle une campagne de désinformation de la Russie sur les vaccins","Données personnelles : le régulateur irlandais sanctionne WhatsApp d'une amende record","Facebook privilégie \"ses intérêts\" au détriment du public, dénonce une lanceuse d’alerte","Conflit sino-américain : le quantique, nerf des guerres de demain ?","Football et cryptomonnaies : des liaisons dangereuses ?","La Nasa va dévier la trajectoire d'un astéroïde lors d'une mission \"historique\"","Prix du pétrole : les États-Unis vont puiser dans leurs réserves stratégiques","Le géant chinois Alibaba, à la recherche des profits perdus","Tir de missile antisatellite : la Russie veut prouver qu’elle n'est pas à la traîne technologique","Moscou tire un missile antisatellite et met en danger l'équipage de l'ISS","Bourse : les grands groupes voient la vie en plus petit pour des maxi profits","Le géant chinois de l'immobilier Evergrande évite un défaut de paiement","La justice de l'UE rejette l'appel de Google contre une amende de 2,4 milliards d'euros","Politique, santé et religion seront écartés du ciblage publicitaire de Facebook","\"Que du plaisir\" : après six mois en orbite, Thomas Pesquet revient en forme en Europe"]}