{"avis":["Les notifications sont bloquées par votre navigateur.En savoir plus sur les notifications web","Les notifications ne sont pas supportées sur votre navigateur.En savoir plus sur les notifications web","Impossible d'activer les notifications, veuillez recharger la page.","Soyez alerté à chaque nouvelle actualité importante","Soyez alerté à chaque nouvelle actualité","Soyez alerté à chaque nouveau bon plan","Soyez alerté à chaque nouvel article Live","Facebook, Instagram et WhatsApp n'étaient pas hors ligne, ils étaient introuvables pendant six heures. Mais ça revient au même...","Source : Christian Wiediger via Unsplash","Ce lundi dans la soirée, c’est une panne massive qu’ont connue les différents services de Facebook. le réseau social principal, mais aussi Messenger, Instagram, WhatsApp et même les jeux Oculus sont restés inaccessibles pendant près de six heures. Un record pour une panne de réseau social qui montre surtout les difficultés techniques qu’ont rencontrées les équipes de Facebook dans la résolution de ce problème.","Pour aller plus loin\nPanne : Facebook, WhatsApp, Instagram et Messenger commencent à revenir après 6 heures","Après la résolution de la panne, le groupe de Mark Zuckerberg s’est fendu d’un court communiqué afin d’expliquer la panne et de présenter ses excuses à ses utilisateurs. « Nous avons travaillé aussi dur que possible pour restaurer l’accès et nos systèmes fonctionnent désormais normalement. La cause sous-jacente de cette panne a également touché de nombreux système et outils internes que nous utilisons dans nos opérations quotidiennes, compliquant nos tentatives de diagnostiquer rapidement et de résoudre le problème ».","Facebook indique ainsi que sa panne aurait eu pour origine des « changements de configuration dans les routeurs qui coordonnent le trafic entre les data centers ». Ces changements de configuration ont eu plusieurs conséquences sur les communications entre les différents serveurs du groupe américain. « Nous voulons vous assurer que nous pensons que les causes de cette panne sont un mauvais changement de configuration. Nous n’avons aucune indication que des données des utilisateurs ont été compromises pendant la panne », tient également à rassurer Facebook. Si le groupe s’est rapidement exprimé sur les causes de la panne qu’il a subie ce lundi, les indications restent cependant vagues et il faut se tourner vers Cloudflare pour mieux comprendre les implications.","Pour rappel, Cloudflare est un réseau de distribution de contenu sur Internet, chargée notamment de faire l’intermédiaire entre l’internaute et le serveur, notamment pour protéger les sites des attaques DDoS. Fort de son expertise technique, Cloudflare a publié, ce lundi, une explication détaillée de la panne dont a été victime Facebook.","Avant de continuer, deux notions sont à prendre en compte : le DNS et le BGP. Dit vulgairement, le DNS donne l’adresse IP du site Internet, son emplacement, tandis que le BGP indique le parcours pour atteindre cette destination. Le DNS, pour Domain Name System, est un service à la base d’Internet qui va permettre de transformer une URL du type « Facebook.com » ou « Frandroid.com » en adresse IP — comme 66.220.144.0 — afin de permettre à votre navigateur de savoir à quel adresse se connecter partout dans le monde. De son côté, le BGP — pour Border Gateway Protocol — va indiquer à votre navigateur le chemin à parcourir pour atteindre l’adresse visée.","Concrètement, il semble que ce soit un changement de configuration BGP qui soit à l’origine de la panne des services Facebook. « Le BGP permet à un réseau — comme Facebook — de promouvoir sa présence auprès des autres réseaux qui forment internet. Au moment où on écrit, Facebook ne promeut plus sa présence, les fournisseurs d’accès et les autres réseaux ne peuvent plus trouver le réseau de Facebook et il est donc indisponible », indique ainsi Cloudflare. De fait, Facebook est donc resté en ligne, mais les opérateurs Internet ne savaient plus comment y accéder.","Du côté des employés de Facebook, ce changement de configuration BGP a eu d’autres conséquences qui expliquent la lenteur de la réparation de la panne. D’abord, les employés de Facebook utilisant des adresses email en @facebook.com, les messages devaient se connecter aux serveurs de Facebook pour être envoyés. Or, en l’absence de serveur, impossible de communiquer par email. Par ailleurs, les serveurs étant déconnectés du réseau Internet, impossible également de les reconfigurer à distance. Il aura fallu que des employés se rendent directement dans les data centers pour interagir en local avec les ordinateurs pour changer la configuration.","C’est finalement après avoir pu entrer dans les data centers que les employés de Facebook ont pu reconfigurer la configuration BGP et rendre à nouveau les différents services visibles par l’ensemble du réseau Internet.","Une panne mondiale touche actuellement les services de Facebook, à savoir Instagram, WhatsApp, Messenger et le réseau social lui-même. Après 6 heures d’interruption, réseaux sociaux et messageries commencent à revenir.\nLire la suite","Pour nous suivre, nous vous invitons à télécharger notre application Android et iOS. Vous pourrez y lire nos articles, dossiers, et regarder nos dernières vidéos YouTube.","Retrouvez l'actualité de WhatsApp","Journaliste smartphone, Hearthstone, Game of Thrones, Essential Phone et tout ce qui finit en \"one\".","Ce VPN passe à moins de 1 €/mois","Panne : Facebook, WhatsApp, Instagram et Messenger commencent à revenir après 6 heures","Messenger, Instagram : le chiffrement de bout en bout n’arrivera pas cette année","Comment supprimer son compte Facebook définitivement ?","Panne Facebook et WhatsApp : Twitter et Signal jubilent, Telegram patine","Panne Facebook : WhatsApp vous a bien plus manqué que Messenger ou Facebook","VOTRE NEWSLETTER PERSONNALISÉE","C'est enregistré ! Surveillez votre boîte aux lettres, vous allez entendre parler de nous !","Recevez le meilleur de l'actu","J’accepte que mon e-mail soit utilisé par Humanoid pour m’envoyer la newsletter Frandroid à la temporalité choisie","Les notifications push vous permettent de recevoir toute l'actualité de Frandroid en temps réel dans votre navigateur ou sur votre téléphone Android.","[…] panne ? Quelle panne ? Des problèmes sur l’effet de Facebook sur la société ? Ah bon ? Non, l’important est de […]","si seulement ces reseaux pouvaient disparaitre pour toujours !!!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntiktok aussi","P'tite faute à \"quel adresse\"","Franchement les pertes momentanées en bourse sont vraiment pas le sujet. Je ne comprends pas le poids que prend cette information dans les médias. Et surtout Mark Zuck a perdu 7 milliards !!! \nLes mouvement boursiers vont et reviennent. \nOn pourrait parler de \n- perte de chiffre d'affaire pendant les 4 heures \n- pertes d'utilisateurs qui ont découverts d'autres apps (signal etc) quel impact futur ? \n- pertes liées à la crédibilité. Les gens ne feront plus confiance à ce que WhatsApp soit leur seul voie de communication avec leurs proches, ils penseront dorénavant toujours à avoir une alternative. ce qui pourrait impacter à long terme?","[…] ou encore Instagram ont donc été hors ligne pendant 6 heures d’affilée. Le lendemain, Facebook a expliqué que cette panne avait pour origine des « changements de configuration dans les routeurs qui […]","De son côté, le BGP — pour Border Gateway Protocol — va indiquer à votre navigateur le chemin à parcourir pour atteindre l’adresse visée\"\n\nPas tout à fait, BGP est totalement invisible du point de vue du navigateur ou de l'ordinateur, l'ordinateur n'a qu'une seule route, celle vers sa box, ensuite la box sait quel est le prochain de point de routage au sein du réseau fu FAI, BGP intervient plus loin sur les routes \"nationales\" ou internationales entre ceux qui possèdes des plages IP \n(appelée AS) pour savoir vers quel AS diriger les paquets à destination de tel ou tel range d'IP on a les tables de routage BGP que chacun échange avec les autres AS et c'est d'ailleurs comme ça qu'on se retrouve avec des détournements massifs de routes (accidentelles ou volontaires), c'est juste un gros résumé.","Ils ont perdu environ 5-6% en bourse pendant quelques heures, avant que leur taux remonte a -4% et finisse aujourd'hui stable. Pour certains c'était une aubaine d'acheter des actions \"un peu\" moins chers pendant quelques heures pour d'autres un cauchemar de ne pas pouvoir poster leur pseudo vie sur Instagram et Facebook. A titre perso, j'ai senti le monde revivre pendant un cours instant, même si Twitter était encore la, j'ai cru que le monde a fini par se débarrasser tout ces réseaux sociaux du \"m'as tu vu\" qui pourrissent la vie des gens. Espérons que Facebook se fasse calmer ou complétement shut down parce que ces réseaux ont détruit toute notion de réalité et d'interactivité des gens au point que c'est nous qui en sommes devenus dépendant et pas l'inverse.","En 6heures, il y a certainement eu la possibilité pour l'état amerloc de transférer les données ni vu ni connu...en étant hors ligne, sans nouvelles données sans cesse mises à jour, bien plus rapide....je dis ça, je dis rien n'est-ce pas ? \nOn me dit tjs anti américain...mais les faits sont là....bien pratique....","Galaxy S21 Ultra : Samsung lance une application pour vous donner la main sur vos photos","3ème dose de vaccin : les applications pour prendre rendez-vous avec un médecin","Quelles sont les meilleurs TV OLED en 2021 ?","Les MEILLEURES OFFRES du Black Friday 2021 À NE PAS LOUPER !","C’est le Black Friday : voici les meilleures offres tech en direct","Les 10 offres immanquables pour ne pas rater votre Black Friday","Les huit TV OLED en promotion pour le Black Friday chez LG, Philips, Panasonic et Hisense","Le chargeur rapide 100W de Ugreen est en promo pour le Black Friday","Black Friday Cdiscount : ces 16 meilleures offres valent vraiment le détour","Les meilleurs aspirateurs Roborock sont à prix cassés pour la Black Week","Black Friday Amazon : les produits Echo, Kindle et Fire TV aux meilleurs prix","Forfait mobile : à partir de 10 euros, RED lance ses offres Black Friday (jusqu’à 300 Go !)","Test de la TicWatch Pro 3 Ultra GPS : une chouette montre de sport légère et modulable","Jabra Elite 85t + chargeur à induction : la Fnac propose -50 % sur ce pack","Phone 13, Airpods Pro, Roborock H7 : les prix s’effondrent chez Rakuten pour le Black Friday","Les capacités du Oppo Find X4 Pro fuitent avant son lancement","Spotify s’inspire de Tiktok pour vous faire découvrir de nouveaux morceaux","Les 10 meilleures offres pour changer son smartphone pendant le Black Friday","Xiaomi Black Shark 4 : voilà un smartphone gaming pas cher pour le Black Friday","Pegasus : la France aussi aurait tenté d’acheter le logiciel espion","Affaire Pegasus : Apple va prévenir les victimes du logiciel espion","Galaxy S22 Ultra : sa configuration photo promet du lourd avec capteur 108 Mpx et zoom optique x10","Black Friday Amazon : le TOP des offres Tech pour faire de bonnes affaires","Kawasaki prend d’assaut les motos électriques : ce que l’on sait sur sa grande offensive","Pendant le Black Friday, cet écran PC de Xiaomi coûte moins de 100 euros","Le store d’Android Automotive continue de grossir avec l’arrivée d’Amazon Music","Bornes de recharge : Ionity compte rattraper son retard sur Tesla, voici comment","Prix inédit pour la nouvelle Samsung Galaxy Watch 4 lors du Black Friday","Quand Microsoft voulait acheter Nintendo : le musée Xbox dévoile un courrier entre les deux firmes","Un PC portable avec une dalle OLED pour le Black Friday ? C’est pas si cher !","WhatsApp vous laisse désormais créer et partager vos propres stickers","Le prix de la fibre internet 1 Gb/s est 60 % moins cher pour le Black Friday Bouygues Telecom","Un vélo électrique aux airs de mécanique, des soucis d’approvisionnement pour Xiaomi et une nouvelle fuite sur le Pixel 6a – Tech’spresso","Stéphane Richard démissionne de son poste de PDG d’Orange après avoir été condamné dans l’affaire Tapie","iPhone 13, Apple Watch Series 6, AirPods Pro… les meilleures offres Apple du Black Friday","Rejoignez la discussion     ","À propos • Mentions légales • Contacts • Archives","Humanoid © 2021 - Frandroid, tous droits réservés","Les notifications sont bloquées par votre navigateur.En savoir plus sur les notifications web","Les notifications ne sont pas supportées sur votre navigateur.En savoir plus sur les notifications web","Impossible d'activer les notifications, veuillez recharger la page.","Soyez alerté à chaque nouvelle actualité importante","Soyez alerté à chaque nouvelle actualité","Soyez alerté à chaque nouveau bon plan","Soyez alerté à chaque nouvel article Live"]}