{"avis":["Technologie : Ne vous attendez pas à une solution immédiatement, ça risque de durer un bon moment. On vous explique, tout ceci est lié à un mystérieux protocole nommé BGP.","Par Steven J. Vaughan-Nichols | Lundi 04 Octobre 2021","Maj 05/10/2021 à 06h38 : Les différents services de Facebook touché par la panne sont désormais rétablis, la panne aura duré six heures. L'entreprise a commencé à communiquer sur la panne. Il s'agit d'un « changement de configuration des routeurs principaux » qui a provoqué un effet en cascade de paralysie des datacenters de l'entreprise.","Le vieux dicton du dépannage de réseau dit que si quelque chose ne va pas, « c'est le DNS ». Et bien, cette fois, le serveur de noms de domaine (DNS) semble être un simple symptôme de la cause fondamentale de la panne globale de Facebook. La véritable cause est qu'il n'y a pas de routes Border Gateway Protocol (BGP) fonctionnelles vers les sites de Facebook.","BGP est le protocole de passerelle extérieure standardisé utilisé pour échanger des informations de routage et d'accessibilité entre les systèmes autonomes (SA) de premier niveau d'internet. La plupart des gens, et même la plupart des administrateurs réseau, n'ont jamais besoin d'utiliser BGP.","Beaucoup de gens ont remarqué que Facebook n'était plus répertorié dans le DNS. En effet, il y a même eu des messages humoristiques proposant de vous vendre le domaine Facebook.com.","Le vice-président de Cloudflare, Dane Knecht, a été le premier à signaler le problème BGP sous-jacent à cette panne géante. Cela signifie, comme l'a tweeté Kevin Beaumont, responsable du centre des opérations de sécurité de Microsoft, qu'« en l'absence d'annonces BGP pour vos serveurs de noms DNS, le DNS s'effondre. Et donc, personne ne peut vous trouver sur internet. Même chose pour WhatsApp. Facebook s'est en quelque sorte déplateformisé de sa propre plateforme ».","Aussi ennuyeux que cela puisse l'être pour vous, ça l'est plus encore pour les employés de Facebook. Selon certaines informations, ils ne peuvent pas entrer dans leurs bâtiments, parce que leurs badges et portes \"intelligentes\" (ahah, peut-être est-il temps de remplacer enfin intelligent par connecté) ont également été désactivés par cette panne de réseau. Si c'est vrai, les employés de Facebook ne peuvent littéralement pas entrer dans le bâtiment pour tenter de réparer la ou les pannes.","Facebook a depuis précisé que ces difficultés techniques ont également affecté ses outils internes, rendant d’autant plus difficile son travail pour résoudre la situation.","Plus tard dans la nuit, Facebook a communiqué sur les origines de la panne. « Nos équipes d’ingénierie ont appris qu’un changement de configuration des routeurs principaux qui coordonnent le trafic entre nos centres de données a entraîné des difficultés techniques aboutissant à l’arrêt de toute communication. Cette interruption des échanges du réseau a eu des effets en cascade sur la façon dont nos centres de données communiquent, provoquant la panne de nos services », expliquait l’entreprise.","Quelques heures avant, l'utilisateur de Reddit u/ramenporn, qui prétendait être un employé de Facebook travaillant à ramener le réseau social d'entre les morts, avait signalé, avant de supprimer son compte et ses messages, que « le DNS pour les services de FB a été affecté, et c'est probablement un symptôme du problème réel, à savoir que l'échange de trafic BGP avec les routeurs d'échange de trafic de Facebook a été interrompu, très probablement en raison d'un changement de configuration entré en vigueur peu de temps avant que les pannes ne surviennent) ».\n\n","Il poursuit : « des personnes essaient maintenant d'accéder aux routeurs d'échange de trafic pour mettre en œuvre des correctifs, mais les personnes ayant un accès physique sont distinctes de celles qui savent comment s'authentifier auprès des systèmes et de celles qui savent ce qu'il faut faire, de sorte qu'il y a maintenant un défi logistique pour unifier toutes ces connaissances. Une partie de cette situation est également due à la diminution des effectifs dans les centres de données en raison des mesures de lutte contre la pandémie ».","Ramenporn a également précisé qu'il ne s'agissait pas d'une attaque, mais d'un changement de configuration erroné effectué via une interface web. Ce qui est vraiment dégoûtant – et pourquoi Facebook est toujours hors service quelques heures plus tard – c'est que, puisque BGP et DNS sont hors service, « la connexion au monde extérieur est hors service, l'accès à distance à ces outils n'existe plus, donc la procédure d'urgence est d'obtenir un accès physique aux routeurs d'échange de trafic et de faire toute la configuration localement ». Bien sûr, les techniciens sur place ne savent pas comment faire et les administrateurs réseau principaux ne sont pas sur place. En bref, c'est un grand gâchis.","Conséquence de cette panne, le cours de Facebook a perdu plus de 6 % à la bourse de New York. Selon l’entreprise, il n’y a aucun signe montrant que les données des utilisateurs aient pu être compromises.","Pour rappel, le réseau social le plus populaire du monde s'est effondré lundi 4 octobre 2021 vers 8h45, heure californienne (soit 17h45, heure française). Mais il n'y a pas que Facebook : Instagram, WhatsApp et Facebook Messenger ont également été touchés par la panne.","Les services de statut de sites web comme DownForEveryoneOrJustMe et DownDetector signalaient alors que Facebook était hors service. Le problème touchait l'intégralité des services de l'entreprise dans le monde entier. En France également, les différents sites avaient cessé de fonctionner, tout comme les applications du groupe.\n\n","Pourquoi le metaverse fascine tant les géants du numérique, à l'instar du groupe Facebook qui a changé son nom pour coller...","Sujet: Facebook Instagram Internet Réseau social WhatsApp ZDNet Web TV","Par Steven J. Vaughan-Nichols | Lundi 04 Octobre 2021","Meta repousse les plans de chiffrement de Messenger et Instagram à 2023","Etats-Unis : Plusieurs Etats enquêtent sur l'impact d'Instagram sur les adolescents","Meilleur écran connecté 2021 : la comparaison des 5 meilleurs écrans pour nous","Qualcomm affiche ses (grosses) ambitions pour le metaverse","Le ZooParc de Beauval relève le challenge de sécuriser son IT avec peu de ressources","Avec PowerEdge, l’IT des PME monte en gamme","Organisation hybride : Quels enjeux pour votre entreprise ?","Samsung Galaxy Z Fold3 5G et Z Flip3 5G : des terminaux nés pour le travail hybride","Frappé par un ransomware ? Assurez-vous de ne pas commettre cette première erreur","iPhone : Optimisez la recharge de votre batterie","iOS 15 : Optimisez l'autonomie de votre iPhone","Le secret pour être plus créatif au travail ? Le timing !","Recevez le meilleur de l'actualité IT Pro chaque jour dans votre boîte mail","\n                    Nous sommes temporairement en mode de maintenance, ce qui signifie que vous ne serez pas en mesure de s'inscrire à une newsletter. S'il vous plaît vérifier à nouveau peu de temps pour reprendre le processus d'abonnement. Merci pour votre patience.\n                ","Nous accompagnons les PME dans leur développement IT. Nous partageons avec vous nos témoignages clients, webinars, livres blancs...\n\n5 dossiers IT à découvrir chaque mois","Vous voulez travailler de n'importe où ? Pensez d'abord à la communication !\n\nVoir le dossier","Télétravail, infrastructure, astuces, innovations...\n\nDécouvrez notre nouvelle rubrique","La déferlante TikTok arrive sur les téléviseurs connectés","AWS adopte Fedora pour la prochaine version d'Amazon Linux","ZD Tech : Metaverse, le serpent de mer numérique revient, voici pourquoi","Metaverse : Niantic le veut en réalité augmentée","E-commerce : Wish lourdement sanctionné en France","XPS Creator Edition : le laptop de référence pour les créatifs","Copyright © 2021 ZDNET, A RED VENTURES COMPANY. ALL RIGHTS RESERVED. CUP Interactive SAS (France). Tous droits réservés.\nMentions légales | Confidentialité | Cookies | Foire aux questions - Vos choix concernant l'utilisation de cookies | Paramétrer les cookies"]}